In [2]:
import pandas as pd

In [5]:
# 2 main datatypes: Series = 1-dimentional & DataFrame = 2-dimensional

# Series
car_brands = pd.Series(["BMW", "Toyota", "Honda"])

In [6]:
car_brands

0       BMW
1    Toyota
2     Honda
dtype: object

In [8]:
colors = pd.Series(["Red", "Blue", "White"])

In [9]:
colors

0      Red
1     Blue
2    White
dtype: object

In [12]:
# DataFrames - more common than the Series

car_data = pd.DataFrame({"Car make": car_brands, "Color": colors})
car_data

  Car make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [15]:
# Usually we are not creating the data from a Series and adding it into DataFrames - instead we are importing the data

!ls

car-sales.csv  smaple_notebook.ipynb

In [17]:
# Import data - after the import, the data is in a DataFrame and we can manipulate it

car_sales = pd.read_csv("car-sales.csv")
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [19]:
# Exporting a DataFrame - will export the file in the same location

car_sales.to_csv("exported-car-sales.csv")

In [20]:
!ls

car-sales.csv  exported-car-sales.csv  smaple_notebook.ipynb

In [21]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00
5           5  Toyota  Green          99213      4   $4,500.00
6           6   Honda   Blue          45698      4   $7,500.00
7           7   Honda   Blue          54738      4   $7,000.00
8           8  Toyota  White          60000      4   $6,250.00
9           9  Nissan  White          31600      4   $9,700.00

In [23]:
# IMPORTANT: when exporting a file, we need to export it with the option to NOT INCLUDE the index
# file_for_export.to_csv("name_of_the_exported_file", index=False)

car_sales.to_csv("new_car_sales.csv", index=False)

In [24]:
!ls

car-sales.csv  exported-car-sales.csv  new_car_sales.csv  smaple_notebook.ipynb

In [25]:
new_car_sales = pd.read_csv("new_car_sales.csv")
new_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

MAIN TAKEAWAYS: 

    Pandas has 2 main data types: Series & DataFrames
    
    We can import data to a DataFrame with pd.read_csv("") & export with var.to_csv("", index=False)
    
    The row in a DataFrame is axis=0 and the column is axis=1